In [1]:
import pandas as pd
import numpy as np

In [8]:
sözlük = {"A":[11]}

In [9]:
tablo1 = pd.DataFrame(sözlük)
tablo1

    A
0  11

In [29]:
dictionary = {"Fakülte":["Makine M.","Endüstri M.","Endüstri M.","Yazılım M.","Yazılım M.","Mekatronik M."],"Öğrenci Sayısı":[1523,23425,235463,246356,1241,56865]}

In [30]:
tablo2 = pd.DataFrame(dictionary)
tablo2

         Fakülte  Öğrenci Sayısı
0      Makine M.            1523
1    Endüstri M.           23425
2    Endüstri M.          235463
3     Yazılım M.          246356
4     Yazılım M.            1241
5  Mekatronik M.           56865

In [31]:
fakülte = tablo2.groupby("Fakülte")

In [32]:
fakülte.count()

               Öğrenci Sayısı
Fakülte
Endüstri M.                 2
Makine M.                   1
Mekatronik M.               1
Yazılım M.                  2

In [33]:
fakülte.mean() # Ortalamasını verir.

               Öğrenci Sayısı
Fakülte
Endüstri M.          129444.0
Makine M.              1523.0
Mekatronik M.         56865.0
Yazılım M.           123798.5

In [34]:
fakülte.min()

               Öğrenci Sayısı
Fakülte
Endüstri M.             23425
Makine M.                1523
Mekatronik M.           56865
Yazılım M.               1241

In [35]:
fakülte.max()

               Öğrenci Sayısı
Fakülte
Endüstri M.            235463
Makine M.                1523
Mekatronik M.           56865
Yazılım M.             246356

In [36]:
fakülte.describe()

              Öğrenci Sayısı                                              \
                       count      mean            std      min       25%
Fakülte
Endüstri M.              2.0  129444.0  149933.507669  23425.0  76434.50
Makine M.                1.0    1523.0            NaN   1523.0   1523.00
Mekatronik M.            1.0   56865.0            NaN  56865.0  56865.00
Yazılım M.               2.0  123798.5  173322.478671   1241.0  62519.75


                    50%        75%       max
Fakülte
Endüstri M.    129444.0  182453.50  235463.0
Makine M.        1523.0    1523.00    1523.0
Mekatronik M.   56865.0   56865.00   56865.0
Yazılım M.     123798.5  185077.25  246356.0